MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX256VMD10/mcu.h
#define LCD Pin Enable                0x7FFFFFFF80000000      // The PEN[63:0] bits enable the LCD_P[63:0] pins for LCD operation. PENL contains PEN[31:0], and PENH contains PEN[63:32].


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_BPENn register.
//
//*****************************************************************************

#define Back Plane Enable             0x7FFFFFFF80000000      // The BPEN[63:0] bits configure the LCD_P[63:0] pins to operate as an LCD back plane or LCD front plane. BPENL contains BPEN[31:0], and BPENH contains BPEN[63:32].


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF3TO0 register.
//
//*****************************************************************************

#define Segment-on front plane operation — Each bit turns on or off the segments associated with LCD_P3 in the following pattern: HGFEDCBA (most significant bit controls segment H and least significant bit controls segment A).0x7F80000000      // 0: Segment off or phase deactivated;; 1: Segment on or phase activated.
#define Controls segments or phases connected to LCD_P2 as described above for WF3.0x7F800000      // 
#define Controls segments or phases connected to LCD_P1 as described above for WF3.0x007F8000      // 
#define Controls segments or phases connected to LCD_P0 as described above for WF3.0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF7TO4 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P7 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P6 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P5 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P4 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF11TO8 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P11 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P10 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P9 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P8 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF15TO12 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P15 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P14 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P13 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P12 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF19TO16 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P19 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P18 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P17 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P16 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF23TO20 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P23 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P22 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P21 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P20 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF27TO24 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P27 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P26 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P25 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P24 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF31TO28 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P31 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P30 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P29 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P28 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF35TO32 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P35 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P34 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P33 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P32 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF39TO36 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P39 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P38 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P37 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P36 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF43TO40 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P43 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P42 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P41 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P40 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF47TO44 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P47 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P46 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P45 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P44 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF51TO48 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P51 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P50 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P49 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P48 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF55TO52 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P55 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P54 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P53 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P52 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF59TO56 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P59 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P58 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P57 as described above for WF3TO0[WF3].0x007F8000      // 
#define Controls segments or phases connected to LCD_P56 as described above for WF3TO0[WF3].0x00007F80      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF63TO60 register.
//
//*****************************************************************************

#define Controls segments or phases connected to LCD_P63 as described above for WF3TO0[WF3].0x7F80000000      // 
#define Controls segments or phases connected to LCD_P62 as described above for WF3TO0[WF3].0x7F800000      // 
#define Controls segments or phases connected to LCD_P61 as described above for WF3TO0[WF3].0x007F8000      // 



#endif // __MK40DX256VMD10_H__

